lib/eway/rapid/request.erb

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Body>
    <CreateAccessCode xmlns="https://nz.ewaypayments.com/hotpotato">
      <request>
      <%= authentication.to_soap %>
      <%= payment.to_soap %>
      </request>
    </CreateAccessCode>
  </soap:Body>
</soap:Envelope>